import { TAboutProject } from '@localTypes/aboutProject'

export const AboutProjectMock: TAboutProject = {
  heading: 'Коттеджный посёлок в Липецком районе',
  smallText: [
    'Хотите купить дом в Липецке или Липецком районе? «Счастливый Квартал» — коттеджный посёлок в с. Ленино Липецкой области, в ЖК «Лазурном», всего в 6 км от Липецка по Воронежскому направлению. В ЖК насчитывается около 100 жилых домов. Рядом строится посёлок таунхаусов с хорошей инфраструктурой.',
    'В Квартале предусмотрено строительство 30 коттеджей по современным проектам, объединенных общей концепцией отделки домов и оформлением улицы (типовой забор, освещение улицы, отсутствие висящих электрических проводов).',
    'Каждый дом с участком от 8 соток строится из качественных материалов и подключается ко всем коммуникациям. Отличительные черты проектов — просторные кухни-гостиные и панорамное остекление.',
  ],
  features: [
    {
      first: {
        label: '8+',
        subtext: 'Соток личного пространства',
      },
      second: {
        label: '30',
        subtext: 'Участков под застройку',
      },
    },
    {
      first: {
        label: '5+',
        subtext: 'Интересных проектов',
      },
      second: {
        label: '0',
        subtext: 'Причин для сомнений',
      },
    },
  ],
  nearbyProject: {
    text: '«Счастливый Квартал» расположен рядом с жилым посёлком «Парковые Кварталы».',
    linkLabel: 'Посмотреть дома рядом с «Парковыми Кварталами»',
    linkUrl: '/doma-ryadom-s-parkovymi-kvartalami',
  },
  // linkToMapProvider: 'https://maps.google.com/?saddr=My%20Location&amp;daddr=50.4142289254263,30.278142662692854',
  // mapText: 'Проложить маршрут',
}
